MikroElektronika/core_packages/PIC/XC8/def/PIC12CE673/mcu.h
// Register: ADRES
#define ADRES ADRES
extern volatile unsigned char           ADRES               __at(0x01E);
#ifndef _LIB_BUILD
asm("ADRES equ 01Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRES                  :8;
    };
} ADRESbits_t;
extern volatile ADRESbits_t ADRESbits __at(0x01E);
// bitfield macros
#define _ADRES_ADRES_POSN                                   0x0
#define _ADRES_ADRES_POSITION                               0x0
#define _ADRES_ADRES_SIZE                                   0x8
#define _ADRES_ADRES_LENGTH                                 0x8
#define _ADRES_ADRES_MASK                                   0xFF

// Register: ADCON0
#define ADCON0 ADCON0
extern volatile unsigned char           ADCON0              __at(0x01F);
#ifndef _LIB_BUILD
asm("ADCON0 equ 01Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADON                   :1;
        unsigned                        :1;
        unsigned GO_nDONE               :1;
        unsigned CHS                    :2;
        unsigned                        :1;
        unsigned ADCS                   :2;
    };
    struct {
        unsigned                        :2;
        unsigned GO_DONE                :1;
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned                        :1;
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned nDONE                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned GO                     :1;
    };
} ADCON0bits_t;
extern volatile ADCON0bits_t ADCON0bits __at(0x01F);
// bitfield macros
#define _ADCON0_ADON_POSN                                   0x0
#define _ADCON0_ADON_POSITION                               0x0
#define _ADCON0_ADON_SIZE                                   0x1
#define _ADCON0_ADON_LENGTH                                 0x1
#define _ADCON0_ADON_MASK                                   0x1
#define _ADCON0_GO_nDONE_POSN                               0x2
#define _ADCON0_GO_nDONE_POSITION                           0x2
#define _ADCON0_GO_nDONE_SIZE                               0x1
#define _ADCON0_GO_nDONE_LENGTH                             0x1
#define _ADCON0_GO_nDONE_MASK                               0x4
#define _ADCON0_CHS_POSN                                    0x3
#define _ADCON0_CHS_POSITION                                0x3
#define _ADCON0_CHS_SIZE                                    0x2
#define _ADCON0_CHS_LENGTH                                  0x2
#define _ADCON0_CHS_MASK                                    0x18
#define _ADCON0_ADCS_POSN                                   0x6
#define _ADCON0_ADCS_POSITION                               0x6
#define _ADCON0_ADCS_SIZE                                   0x2
#define _ADCON0_ADCS_LENGTH                                 0x2
#define _ADCON0_ADCS_MASK                                   0xC0
#define _ADCON0_GO_DONE_POSN                                0x2
#define _ADCON0_GO_DONE_POSITION                            0x2
#define _ADCON0_GO_DONE_SIZE                                0x1
#define _ADCON0_GO_DONE_LENGTH                              0x1
#define _ADCON0_GO_DONE_MASK                                0x4
#define _ADCON0_CHS0_POSN                                   0x3
#define _ADCON0_CHS0_POSITION                               0x3
#define _ADCON0_CHS0_SIZE                                   0x1
#define _ADCON0_CHS0_LENGTH                                 0x1
#define _ADCON0_CHS0_MASK                                   0x8
#define _ADCON0_CHS1_POSN                                   0x4
#define _ADCON0_CHS1_POSITION                               0x4
#define _ADCON0_CHS1_SIZE                                   0x1
#define _ADCON0_CHS1_LENGTH                                 0x1
#define _ADCON0_CHS1_MASK                                   0x10
#define _ADCON0_ADCS0_POSN                                  0x6
#define _ADCON0_ADCS0_POSITION                              0x6
#define _ADCON0_ADCS0_SIZE                                  0x1
#define _ADCON0_ADCS0_LENGTH                                0x1
#define _ADCON0_ADCS0_MASK                                  0x40
#define _ADCON0_ADCS1_POSN                                  0x7
#define _ADCON0_ADCS1_POSITION                              0x7
#define _ADCON0_ADCS1_SIZE                                  0x1
#define _ADCON0_ADCS1_LENGTH                                0x1
#define _ADCON0_ADCS1_MASK                                  0x80
#define _ADCON0_nDONE_POSN                                  0x2
#define _ADCON0_nDONE_POSITION                              0x2
#define _ADCON0_nDONE_SIZE                                  0x1
#define _ADCON0_nDONE_LENGTH                                0x1
#define _ADCON0_nDONE_MASK                                  0x4
#define _ADCON0_GO_POSN                                     0x2
#define _ADCON0_GO_POSITION                                 0x2
#define _ADCON0_GO_SIZE                                     0x1
#define _ADCON0_GO_LENGTH                                   0x1
#define _ADCON0_GO_MASK                                     0x4

// Register: OPTION_REG
#define OPTION_REG OPTION_REG
extern volatile unsigned char           OPTION_REG          __at(0x081);
#ifndef _LIB_BUILD
asm("OPTION_REG equ 081h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PS                     :3;
        unsigned PSA                    :1;
        unsigned T0SE                   :1;
        unsigned T0CS                   :1;
        unsigned INTEDG                 :1;
        unsigned nGPPU                  :1;
    };
    struct {
        unsigned PS0                    :1;
        unsigned PS1                    :1;
        unsigned PS2                    :1;
    };
} OPTION_REGbits_t;
extern volatile OPTION_REGbits_t OPTION_REGbits __at(0x081);
// bitfield macros
#define _OPTION_REG_PS_POSN                                 0x0
#define _OPTION_REG_PS_POSITION                             0x0
#define _OPTION_REG_PS_SIZE                                 0x3
#define _OPTION_REG_PS_LENGTH                               0x3
#define _OPTION_REG_PS_MASK                                 0x7
#define _OPTION_REG_PSA_POSN                                0x3
#define _OPTION_REG_PSA_POSITION                            0x3
#define _OPTION_REG_PSA_SIZE                                0x1
#define _OPTION_REG_PSA_LENGTH                              0x1
#define _OPTION_REG_PSA_MASK                                0x8
#define _OPTION_REG_T0SE_POSN                               0x4
#define _OPTION_REG_T0SE_POSITION                           0x4
#define _OPTION_REG_T0SE_SIZE                               0x1
#define _OPTION_REG_T0SE_LENGTH                             0x1
#define _OPTION_REG_T0SE_MASK                               0x10
#define _OPTION_REG_T0CS_POSN                               0x5
#define _OPTION_REG_T0CS_POSITION                           0x5
#define _OPTION_REG_T0CS_SIZE                               0x1
#define _OPTION_REG_T0CS_LENGTH                             0x1
#define _OPTION_REG_T0CS_MASK                               0x20
#define _OPTION_REG_INTEDG_POSN                             0x6
#define _OPTION_REG_INTEDG_POSITION                         0x6
#define _OPTION_REG_INTEDG_SIZE                             0x1
#define _OPTION_REG_INTEDG_LENGTH                           0x1
#define _OPTION_REG_INTEDG_MASK                             0x40
#define _OPTION_REG_nGPPU_POSN                              0x7
#define _OPTION_REG_nGPPU_POSITION                          0x7
#define _OPTION_REG_nGPPU_SIZE                              0x1
#define _OPTION_REG_nGPPU_LENGTH                            0x1
#define _OPTION_REG_nGPPU_MASK                              0x80
#define _OPTION_REG_PS0_POSN                                0x0
#define _OPTION_REG_PS0_POSITION                            0x0
#define _OPTION_REG_PS0_SIZE                                0x1
#define _OPTION_REG_PS0_LENGTH                              0x1
#define _OPTION_REG_PS0_MASK                                0x1
#define _OPTION_REG_PS1_POSN                                0x1
#define _OPTION_REG_PS1_POSITION                            0x1
#define _OPTION_REG_PS1_SIZE                                0x1
#define _OPTION_REG_PS1_LENGTH                              0x1
#define _OPTION_REG_PS1_MASK                                0x2
#define _OPTION_REG_PS2_POSN                                0x2
#define _OPTION_REG_PS2_POSITION                            0x2
#define _OPTION_REG_PS2_SIZE                                0x1
#define _OPTION_REG_PS2_LENGTH                              0x1
#define _OPTION_REG_PS2_MASK                                0x4

// Register: TRIS
#define TRIS TRIS
extern volatile unsigned char           TRIS                __at(0x085);
#ifndef _LIB_BUILD
asm("TRIS_REG equ 085h");
#endif
// aliases
extern volatile unsigned char           TRISIO              __at(0x085);
#ifndef _LIB_BUILD
asm("TRISIO equ 085h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRIS0                  :1;
        unsigned TRIS1                  :1;
        unsigned TRIS2                  :1;
        unsigned TRIS3                  :1;
        unsigned TRIS4                  :1;
        unsigned TRIS5                  :1;
    };
} TRISbits_t;
extern volatile TRISbits_t TRISbits __at(0x085);
// bitfield macros
#define _TRIS_TRIS0_POSN                                    0x0
#define _TRIS_TRIS0_POSITION                                0x0
#define _TRIS_TRIS0_SIZE                                    0x1
#define _TRIS_TRIS0_LENGTH                                  0x1
#define _TRIS_TRIS0_MASK                                    0x1
#define _TRIS_TRIS1_POSN                                    0x1
#define _TRIS_TRIS1_POSITION                                0x1
#define _TRIS_TRIS1_SIZE                                    0x1
#define _TRIS_TRIS1_LENGTH                                  0x1
#define _TRIS_TRIS1_MASK                                    0x2
#define _TRIS_TRIS2_POSN                                    0x2
#define _TRIS_TRIS2_POSITION                                0x2
#define _TRIS_TRIS2_SIZE                                    0x1
#define _TRIS_TRIS2_LENGTH                                  0x1
#define _TRIS_TRIS2_MASK                                    0x4
#define _TRIS_TRIS3_POSN                                    0x3
#define _TRIS_TRIS3_POSITION                                0x3
#define _TRIS_TRIS3_SIZE                                    0x1
#define _TRIS_TRIS3_LENGTH                                  0x1
#define _TRIS_TRIS3_MASK                                    0x8
#define _TRIS_TRIS4_POSN                                    0x4
#define _TRIS_TRIS4_POSITION                                0x4
#define _TRIS_TRIS4_SIZE                                    0x1
#define _TRIS_TRIS4_LENGTH                                  0x1
#define _TRIS_TRIS4_MASK                                    0x10
#define _TRIS_TRIS5_POSN                                    0x5
#define _TRIS_TRIS5_POSITION                                0x5
#define _TRIS_TRIS5_SIZE                                    0x1
#define _TRIS_TRIS5_LENGTH                                  0x1
#define _TRIS_TRIS5_MASK                                    0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned TRIS0                  :1;
        unsigned TRIS1                  :1;
        unsigned TRIS2                  :1;
        unsigned TRIS3                  :1;
        unsigned TRIS4                  :1;
        unsigned TRIS5                  :1;
    };
} TRISIObits_t;
extern volatile TRISIObits_t TRISIObits __at(0x085);
// bitfield macros
#define _TRISIO_TRIS0_POSN                                  0x0
#define _TRISIO_TRIS0_POSITION                              0x0
#define _TRISIO_TRIS0_SIZE                                  0x1
#define _TRISIO_TRIS0_LENGTH                                0x1
#define _TRISIO_TRIS0_MASK                                  0x1
#define _TRISIO_TRIS1_POSN                                  0x1
#define _TRISIO_TRIS1_POSITION                              0x1
#define _TRISIO_TRIS1_SIZE                                  0x1
#define _TRISIO_TRIS1_LENGTH                                0x1
#define _TRISIO_TRIS1_MASK                                  0x2
#define _TRISIO_TRIS2_POSN                                  0x2
#define _TRISIO_TRIS2_POSITION                              0x2
#define _TRISIO_TRIS2_SIZE                                  0x1
#define _TRISIO_TRIS2_LENGTH                                0x1
#define _TRISIO_TRIS2_MASK                                  0x4
#define _TRISIO_TRIS3_POSN                                  0x3
#define _TRISIO_TRIS3_POSITION                              0x3
#define _TRISIO_TRIS3_SIZE                                  0x1
#define _TRISIO_TRIS3_LENGTH                                0x1
#define _TRISIO_TRIS3_MASK                                  0x8
#define _TRISIO_TRIS4_POSN                                  0x4
#define _TRISIO_TRIS4_POSITION                              0x4
#define _TRISIO_TRIS4_SIZE                                  0x1
#define _TRISIO_TRIS4_LENGTH                                0x1
#define _TRISIO_TRIS4_MASK                                  0x10
#define _TRISIO_TRIS5_POSN                                  0x5
#define _TRISIO_TRIS5_POSITION                              0x5
#define _TRISIO_TRIS5_SIZE                                  0x1
#define _TRISIO_TRIS5_LENGTH                                0x1
#define _TRISIO_TRIS5_MASK                                  0x20

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0x08C);
#ifndef _LIB_BUILD
asm("PIE1 equ 08Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :6;
        unsigned ADIE                   :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0x08C);
// bitfield macros
#define _PIE1_ADIE_POSN                                     0x6
#define _PIE1_ADIE_POSITION                                 0x6
#define _PIE1_ADIE_SIZE                                     0x1
#define _PIE1_ADIE_LENGTH                                   0x1
#define _PIE1_ADIE_MASK                                     0x40

// Register: PCON
#define PCON PCON
extern volatile unsigned char           PCON                __at(0x08E);
#ifndef _LIB_BUILD
asm("PCON equ 08Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned nPOR                   :1;
    };
} PCONbits_t;
extern volatile PCONbits_t PCONbits __at(0x08E);
// bitfield macros
#define _PCON_nPOR_POSN                                     0x1
#define _PCON_nPOR_POSITION                                 0x1
#define _PCON_nPOR_SIZE                                     0x1
#define _PCON_nPOR_LENGTH                                   0x1
#define _PCON_nPOR_MASK                                     0x2

// Register: OSCCAL
#define OSCCAL OSCCAL
extern volatile unsigned char           OSCCAL              __at(0x08F);
#ifndef _LIB_BUILD
asm("OSCCAL equ 08Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned CALSLW                 :1;
        unsigned CALFST                 :1;
        unsigned CAL                    :4;
    };
    struct {
        unsigned                        :4;
        unsigned CAL0                   :1;
        unsigned CAL1                   :1;
        unsigned CAL2                   :1;
        unsigned CAL3                   :1;
    };
} OSCCALbits_t;
extern volatile OSCCALbits_t OSCCALbits __at(0x08F);
// bitfield macros
#define _OSCCAL_CALSLW_POSN                                 0x2
#define _OSCCAL_CALSLW_POSITION                             0x2
#define _OSCCAL_CALSLW_SIZE                                 0x1
#define _OSCCAL_CALSLW_LENGTH                               0x1
#define _OSCCAL_CALSLW_MASK                                 0x4
#define _OSCCAL_CALFST_POSN                                 0x3
#define _OSCCAL_CALFST_POSITION                             0x3
#define _OSCCAL_CALFST_SIZE                                 0x1
#define _OSCCAL_CALFST_LENGTH                               0x1
#define _OSCCAL_CALFST_MASK                                 0x8
#define _OSCCAL_CAL_POSN                                    0x4
#define _OSCCAL_CAL_POSITION                                0x4
#define _OSCCAL_CAL_SIZE                                    0x4
#define _OSCCAL_CAL_LENGTH                                  0x4
#define _OSCCAL_CAL_MASK                                    0xF0
#define _OSCCAL_CAL0_POSN                                   0x4
#define _OSCCAL_CAL0_POSITION                               0x4
#define _OSCCAL_CAL0_SIZE                                   0x1
#define _OSCCAL_CAL0_LENGTH                                 0x1
#define _OSCCAL_CAL0_MASK                                   0x10
#define _OSCCAL_CAL1_POSN                                   0x5
#define _OSCCAL_CAL1_POSITION                               0x5
#define _OSCCAL_CAL1_SIZE                                   0x1
#define _OSCCAL_CAL1_LENGTH                                 0x1
#define _OSCCAL_CAL1_MASK                                   0x20
#define _OSCCAL_CAL2_POSN                                   0x6
#define _OSCCAL_CAL2_POSITION                               0x6
#define _OSCCAL_CAL2_SIZE                                   0x1
#define _OSCCAL_CAL2_LENGTH                                 0x1
#define _OSCCAL_CAL2_MASK                                   0x40
#define _OSCCAL_CAL3_POSN                                   0x7
#define _OSCCAL_CAL3_POSITION                               0x7
#define _OSCCAL_CAL3_SIZE                                   0x1
#define _OSCCAL_CAL3_LENGTH                                 0x1
#define _OSCCAL_CAL3_MASK                                   0x80

// Register: ADCON1
#define ADCON1 ADCON1
extern volatile unsigned char           ADCON1              __at(0x09F);
#ifndef _LIB_BUILD
asm("ADCON1 equ 09Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCFG                   :3;
    };
    struct {
        unsigned PCFG0                  :1;
        unsigned PCFG1                  :1;
        unsigned PCFG2                  :1;
    };
} ADCON1bits_t;
